ArakniD/simplelink_msp432p4_sdk/examples/rtos/MSP_EXP432P4111/demos/uartdma_msp432p4111/MSP_EXP432P4111.c
const uint_least8_t NVS_count = MSP_EXP432P4111_NVSCOUNT;

typedef enum PowerMSP432_PowerLevel_Custom {
    ePowerStateCustomAraknid = ePowerStateSDKMax,
    ePowerStateCustomAraknidOCT,
    ePowerStateCustomMax
} PowerMSP432_PowerLevel_Custom;

static PowerMSP432_PerfLevel PowerMSP432_BoardLevels[] =
{
   /* ePowerStateCustomAraknid */
   { .activeState = PCM_AM_DCDC_VCORE0,
     .VCORE = 0,
     .DCOCLK = CS_24MHZ | PowerMSP432_DCORESFORCE,
     .SELM = CS_DCOCLK_SELECT,
     .DIVM = CS_CLOCK_DIVIDER_1,
     .SELS = CS_DCOCLK_SELECT,
     .DIVHS = CS_CLOCK_DIVIDER_2,
     .DIVS = CS_CLOCK_DIVIDER_4,
     .SELB = CS_REFOCLK_SELECT,
     .SELA = CS_REFOCLK_SELECT,
     .DIVA = CS_CLOCK_DIVIDER_1,
     .flashWaitStates = 2,
     .enableFlashBuffer = true,
     .MCLK   = 24000000,
     .HSMCLK = 24000000,
     .SMCLK  = 6000000,
     .SWOCLK = 3000000,
     .BCLK = 32768,
     .ACLK = 32768
   },
   /* ePowerStateCustomAraknidOCT */
   { .activeState = PCM_AM_DCDC_VCORE1,
     .VCORE = 1,
     .DCOCLK = CS_32MHZ | PowerMSP432_DCORESFORCE,
     .SELM = CS_DCOCLK_SELECT,
     .DIVM = CS_CLOCK_DIVIDER_1,
     .SELS = CS_DCOCLK_SELECT,
     .DIVHS = CS_CLOCK_DIVIDER_2,
     .DIVS = CS_CLOCK_DIVIDER_4,
     .SELB = CS_REFOCLK_SELECT,
     .SELA = CS_REFOCLK_SELECT,
     .DIVA = CS_CLOCK_DIVIDER_1,
     .flashWaitStates = 3,
     .enableFlashBuffer = true,
     .MCLK   = 32000000,
     .HSMCLK = 32000000,
     .SMCLK  = 8000000,
     .SWOCLK = 4000000,
     .BCLK = 32768,
     .ACLK = 32768
   }
} ;

/*
 *  =============================== Power ===============================
 */
const PowerMSP432_ConfigV1 PowerMSP432_config = {
   .policyInitFxn = &PowerMSP432_initPolicy,
   .policyFxn = &PowerMSP432_sleepPolicy,
   .initialPerfLevel = ePowerStateP4x1xI_Limit,
   .enablePolicy = true,
   .enablePerf = true,
   .enableParking = true,
   .numCustom = (ePowerStateCustomMax - ePowerStateSDKMax),
   .customPerfLevels = PowerMSP432_BoardLevels
};

/*
 *  =============================== PWM ===============================
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerMSP432.h>

PWMTimerMSP432_Object pwmTimerMSP432Objects[MSP_EXP432P4111_PWMCOUNT];

const PWMTimerMSP432_HWAttrsV2 pwmTimerMSP432HWAttrs[MSP_EXP432P4111_PWMCOUNT] = {
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_0_TA1CCR1A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_1_TA1CCR2A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_2_TA1CCR3A
    }
};

const PWM_Config PWM_config[MSP_EXP432P4111_PWMCOUNT] = {
    {
        .fxnTablePtr = &PWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[MSP_EXP432P4111_PWM_TA1_1],
        .hwAttrs = &pwmTimerMSP432HWAttrs[MSP_EXP432P4111_PWM_TA1_1]
    },
    {
        .fxnTablePtr = &PWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[MSP_EXP432P4111_PWM_TA1_2],
        .hwAttrs = &pwmTimerMSP432HWAttrs[MSP_EXP432P4111_PWM_TA1_2]
    },
    {
        .fxnTablePtr = &PWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[MSP_EXP432P4111_PWM_TA1_3],
        .hwAttrs = &pwmTimerMSP432HWAttrs[MSP_EXP432P4111_PWM_TA1_3]
    }
};

const uint_least8_t PWM_count = MSP_EXP432P4111_PWMCOUNT;

#if 0
/*
 *  =============================== SDFatFS ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/SDFatFS.h>

/*
 * Note: The SDFatFS driver provides interface functions to enable FatFs
 * but relies on the SD driver to communicate with SD cards.  Opening a
 * SDFatFs driver instance will internally try to open a SD driver instance
 * reusing the same index number (opening SDFatFs driver at index 0 will try to
 * open SD driver at index 0).  This requires that all SDFatFs driver instances
 * have an accompanying SD driver instance defined with the same index.  It is
 * acceptable to have more SD driver instances than SDFatFs driver instances
 * but the opposite is not supported & the SDFatFs will fail to open.
 */
SDFatFS_Object sdfatfsObjects[MSP_EXP432P4111_SDFatFSCOUNT];

const SDFatFS_Config SDFatFS_config[MSP_EXP432P4111_SDFatFSCOUNT] = {
    {
        .object = &sdfatfsObjects[MSP_EXP432P4111_SDFatFS0]
    }
};

const uint_least8_t SDFatFS_count = MSP_EXP432P4111_SDFatFSCOUNT;
#endif
#if 0
/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[MSP_EXP432P4111_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[MSP_EXP432P4111_SDCOUNT] = {
    {
        .spiIndex = MSP_EXP432P4111_SPIB0,
        .spiCsGpioIndex = MSP_EXP432P4111_SDSPI_CS
    }
};

const SD_Config SD_config[MSP_EXP432P4111_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[MSP_EXP432P4111_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[MSP_EXP432P4111_SDSPI0]
    },
};

const uint_least8_t SD_count = MSP_EXP432P4111_SDCOUNT;
#endif

/*
 *  =============================== SPI ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPIMSP432DMA.h>

SPIMSP432DMA_Object spiMSP432DMAObjects[MSP_EXP432P4111_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPIMSP432DMA_HWAttrsV1 spiMSP432DMAHWAttrs[MSP_EXP432P4111_SPICOUNT] = {
    {
        .baseAddr = EUSCI_B0_BASE,
        .bitOrder = EUSCI_B_SPI_MSB_FIRST,
        .clockSource = EUSCI_B_SPI_CLOCKSOURCE_SMCLK,
        .defaultTxBufValue = 0xFF,
        .dmaIntNum = INT_DMA_INT1,
        .intPriority = NVIC_PRIO(DISPLAY_PRIO),
        .rxDMAChannelIndex = DMA_CH1_EUSCIB0RX0,
        .txDMAChannelIndex = DMA_CH0_EUSCIB0TX0,
        .clkPin  = SPIMSP432DMA_P1_5_UCB0CLK,
        .simoPin = SPIMSP432DMA_P1_6_UCB0SIMO,
        .somiPin = SPIMSP432DMA_P1_7_UCB0SOMI,
        .stePin  = SPIMSP432DMA_P1_4_UCB0STE,
        .pinMode  = EUSCI_SPI_3PIN,
        .minDmaTransferSize = 10
    },
#if 0
    {
        .baseAddr = EUSCI_B2_BASE,
        .bitOrder = EUSCI_B_SPI_MSB_FIRST,
        .clockSource = EUSCI_B_SPI_CLOCKSOURCE_SMCLK,
        .defaultTxBufValue = 0xFF,
        .dmaIntNum = INT_DMA_INT2,
        .intPriority = NVIC_PRIO(LOWEST_PRIO),
        .rxDMAChannelIndex = DMA_CH5_EUSCIB2RX0,
        .txDMAChannelIndex = DMA_CH4_EUSCIB2TX0,
        .clkPin  = SPIMSP432DMA_P3_5_UCB2CLK,
        .simoPin = SPIMSP432DMA_P3_6_UCB2SIMO,
        .somiPin = SPIMSP432DMA_P3_7_UCB2SOMI,
        .stePin  = SPIMSP432DMA_P3_4_UCB2STE,
        .pinMode  = EUSCI_SPI_3PIN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr = EUSCI_A1_BASE,
        .bitOrder = EUSCI_A_SPI_MSB_FIRST,
        .clockSource = EUSCI_A_SPI_CLOCKSOURCE_SMCLK,
        .defaultTxBufValue = 0xFF,
        .dmaIntNum = INT_DMA_INT2,
        .intPriority = NVIC_PRIO(LOWEST_PRIO),
        .rxDMAChannelIndex = DMA_CH3_EUSCIA1RX,
        .txDMAChannelIndex = DMA_CH2_EUSCIA1TX,
        .clkPin  = SPIMSP432DMA_P2_5_UCA1CLK,
        .simoPin = SPIMSP432DMA_P2_6_UCA1SIMO,
        .somiPin = SPIMSP432DMA_P2_7_UCA1SOMI,
        .stePin  = SPIMSP432DMA_P2_3_UCA1STE,
        .pinMode  = EUSCI_SPI_4PIN_UCxSTE_ACTIVE_LOW,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr = EUSCI_B2_BASE,
        .bitOrder = EUSCI_B_SPI_MSB_FIRST,
        .clockSource = EUSCI_B_SPI_CLOCKSOURCE_SMCLK,
        .defaultTxBufValue = 0xFF,
        .dmaIntNum = INT_DMA_INT3,
        .intPriority = NVIC_PRIO(LOWEST_PRIO),
        .rxDMAChannelIndex = DMA_CH5_EUSCIB2RX0,
        .txDMAChannelIndex = DMA_CH4_EUSCIB2TX0,
        .clkPin  = SPIMSP432DMA_P3_5_UCB2CLK,
        .simoPin = SPIMSP432DMA_P3_6_UCB2SIMO,
        .somiPin = SPIMSP432DMA_P3_7_UCB2SOMI,
        .stePin  = SPIMSP432DMA_P2_4_UCB2STE,
        .pinMode  = EUSCI_SPI_4PIN_UCxSTE_ACTIVE_LOW,
        .minDmaTransferSize = 10
    }
#endif
};

const SPI_Config SPI_config[MSP_EXP432P4111_SPICOUNT] = {
    {
        .fxnTablePtr = &SPIMSP432DMA_fxnTable,
        .object = &spiMSP432DMAObjects[MSP_EXP432P4111_SPIB0],
        .hwAttrs = &spiMSP432DMAHWAttrs[MSP_EXP432P4111_SPIB0]
    },
#if 0
    {
        .fxnTablePtr = &SPIMSP432DMA_fxnTable,
        .object = &spiMSP432DMAObjects[MSP_EXP432P4111_SPIB2],
        .hwAttrs = &spiMSP432DMAHWAttrs[MSP_EXP432P4111_SPIB2]
    },
    {
        .fxnTablePtr = &SPIMSP432DMA_fxnTable,
        .object = &spiMSP432DMAObjects[MSP_EXP432P4111_SPIB3],
        .hwAttrs = &spiMSP432DMAHWAttrs[MSP_EXP432P4111_SPIB3]
    },
    {
        .fxnTablePtr = &SPIMSP432DMA_fxnTable,
        .object = &spiMSP432DMAObjects[MSP_EXP432P4111_SPIB4],
        .hwAttrs = &spiMSP432DMAHWAttrs[MSP_EXP432P4111_SPIB4]
    }
#endif
};

const uint_least8_t SPI_count = MSP_EXP432P4111_SPICOUNT;

