ArakniD/simplelink_msp432p4_sdk/examples/rtos/MSP_EXP432P4111/demos/uartdma_msp432p4111/MSP_EXP432P4111.c
/*
 *  =============================== Timer ===============================
 */
#include <ti/drivers/Timer.h>
#include <ti/drivers/timer/TimerMSP432.h>

TimerMSP432_Object timerMSP432Objects[MSP_EXP432P4111_TIMERCOUNT];

const TimerMSP432_HWAttrs timerMSP432HWAttrs[MSP_EXP432P4111_TIMERCOUNT] = {
    /* Timer32_0 */
    {
        .timerBaseAddress = TIMER32_0_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .intNum = INT_T32_INT1,
        .intPriority = NVIC_PRIO(CAPTURE_PRIO)
    },
    {
        .timerBaseAddress = TIMER32_1_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .intNum = INT_T32_INT2,
        .intPriority = NVIC_PRIO(CAPTURE_PRIO)
    },
    /* Timer_A0 */
    {
        .timerBaseAddress = TIMER_A0_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA0_0,
        .intPriority = NVIC_PRIO(CAPTURE_PRIO)
    },
    /* Timer_A2 */
    {
        .timerBaseAddress = TIMER_A2_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA2_0,
        .intPriority = NVIC_PRIO(CAPTURE_PRIO)
    },
    /* Timer_A3 */
    {
        .timerBaseAddress = TIMER_A3_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA3_0,
        .intPriority = NVIC_PRIO(CAPTURE_PRIO)
    }
};

const Timer_Config Timer_config[MSP_EXP432P4111_TIMERCOUNT] = {
    {
        .fxnTablePtr = &TimerMSP432_Timer32_fxnTable,
        .object = &timerMSP432Objects[MSP_EXP432P4111_TIMER_T32_0],
        .hwAttrs = &timerMSP432HWAttrs[MSP_EXP432P4111_TIMER_T32_0]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer32_fxnTable,
        .object = &timerMSP432Objects[MSP_EXP432P4111_TIMER_T32_1],
        .hwAttrs = &timerMSP432HWAttrs[MSP_EXP432P4111_TIMER_T32_1]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[MSP_EXP432P4111_TIMER_TA_0],
        .hwAttrs = &timerMSP432HWAttrs[MSP_EXP432P4111_TIMER_TA_0]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[MSP_EXP432P4111_TIMER_TA_2],
        .hwAttrs = &timerMSP432HWAttrs[MSP_EXP432P4111_TIMER_TA_2]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[MSP_EXP432P4111_TIMER_TA_3],
        .hwAttrs = &timerMSP432HWAttrs[MSP_EXP432P4111_TIMER_TA_3]
    }
};

const uint_least8_t Timer_count = MSP_EXP432P4111_TIMERCOUNT;

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTMSP432.h>
#include <ti/drivers/uart/UARTMSP432DMA.h>

static UARTMSP432DMA_Object uartMSP432DMAObjects[2];
static unsigned char uartMSP432DMARingBuffer[2][1024];
static unsigned char uartMSP432DMAWriteBuffer[2][1024];

static UARTMSP432_Object uartMSP432Objects[2];
static unsigned char uartMSP432RingBuffer[2][32];

/*
 * The baudrate dividers were determined by using the MSP432 baudrate
 * calculator
 * http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
 */
const UARTMSP432_BaudrateConfig uartMSP432Baudrates[] = {
    /* {baudrate, input clock, prescalar, UCBRFx, UCBRSx, oversampling} */
    {
        .outputBaudrate = 115200,
        .inputClockFreq = 48000000,
        .prescalar = 26,
        .hwRegUCBRFx = 0,
        .hwRegUCBRSx = 111,
        .oversampling = 1
    },
    {115200,24000000, 13,   0,  37, 1},
    {115200,12000000,  6,   8,  32, 1},
    {115200, 8000000,  4,   5,  81, 1},
    {115200, 6000000,  3,   4,   2, 1},
    {115200, 3000000,  1,  10,   0, 1},
    {9600,  24000000, 156,  4,   0, 1},
    {9600,  12000000,  78,  2,   0, 1},
    {9600,   8000000,  52,  1,  73, 1},
    {9600,   6000000,  39,  1,   0, 1},
    {9600,   3000000,  19,  8,  85, 1},
    {9600,   32768,     3,  0, 146, 0}
};

/*
 * The baudrate dividers were determined by using the MSP432 baudrate
 * calculator
 * http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
 */
const UARTMSP432DMA_BaudrateConfig uartMSP432DMABaudrates[] =
{
    /* {baudrate, input clock, prescalar, UCBRFx, UCBRSx, oversampling} */
    /* Baud rates above 1MBit require DMA or else */
    {6000000, 24e6,  4,  0,   0, 0},
    {4800000, 24e6,  5,  0,   0, 0},
    {4000000, 24e6,  6,  0,   0, 0},
    {3000000, 48e6, 16,  0,   0, 0},
    {3000000, 24e6,  8,  0,   0, 0},
    {3000000, 12e6,  4,  0,   0, 0},
    {2666667, 24e6,  9,  0,   0, 0},
    {2400000, 24e6, 10,  0,   0, 0},
    {2181818, 24e6, 11,  0,   0, 0},
    {2000000, 48e6, 24,  0,   0, 0},
    {2000000, 24e6, 12,  0,   0, 0},
    {2000000, 12e6,  6,  0,   0, 0},
    {2000000, 8e6,   4,  0,   0, 0},
    {1600000, 8e6,   5,  0,   0, 0},
    {1500000, 48e6, 32,  0,   0, 0},
    {1500000, 24e6, 16,  0,   0, 0},
    {1500000, 12e6,  8,  0,   0, 0},
    {1500000,  8e6,  5,  0,  73, 0},
    {1500000,  6e6,  4,  0,   0, 0},
    {1333333,  8e6,  6,  0,   0, 0},
    {1200000, 48e6, 40,  0,   0, 0},
    {1200000, 24e6, 20,  0,   0, 0},
    {1200000, 12e6, 10,  0,   0, 0},
    {1200000,  8e6,  6,  0, 119, 0},
    {1000000, 48e6, 48,  0,   0, 0},
    {1000000, 24e6, 24,  0,   0, 0},
    {1000000, 12e6, 12,  0,   0, 0},
    {1000000,  8e6,  8,  0,   0, 0},
    {1000000,  6e6,  6,  0,   0, 0},
    { 888889,  8e6,  9,  0,   0, 0},
    { 800000,  8e6, 10,  0,   0, 0},
    { 750000, 48e6, 64,  0,   0, 0},
    { 750000, 24e6, 32,  0,   0, 0},
    { 750000, 12e6, 16,  0,   0, 0},
    { 750000,  8e6, 10,  0, 182, 0},
    { 750000,  6e6,  8,  0,   0, 0},
    { 727273,  8e6, 11,  0,   0, 0},
    { 666667,  8e6, 12,  0,   0, 0},
    { 600000,  6e6, 10,  0,   0, 0},
    { 533333,  8e6, 15,  0,   0, 0},
    { 500000,  8e6, 16,  0,   0, 0},
    { 444444,  8e6, 18,  0,   0, 0},
    { 400000,  8e6, 20,  0,   0, 0},
    { 115200, 48e6, 26,  0, 111, 1},
    { 115200, 24e6, 13,  0,  37, 1},
    { 115200, 12e6,  6,  8,  32, 1},
    { 115200, 08e6,  4,  5,  81, 1},
    { 115200, 06e6,  3,  4,   2, 1},
    { 115200, 03e6,  1, 10,   0, 1},
    {   9600, 24e6,156,  4,   0, 1},
    {   9600, 12e6, 78,  2,   0, 1},
    {   9600, 08e6, 52,  1,  73, 1},
    {   9600, 06e6, 39,  1,   0, 1},
    {   9600, 03e6, 19,  8,  85, 1},
    {   9600,32768,  3,  0, 146, 0}
};

