ArakniD/simplelink_msp432p4_sdk/examples/rtos/MSP_EXP432P4111/demos/uartdma_msp432p4111/MSP_EXP432P4111.c
extern long dma_uart_error(UART_Handle handle,  uint32_t error);

const UARTMSP432DMA_HWAttrsV1 uartMSP432DMAHWAttrs[2] = {
    {
        .baseAddr = EUSCI_A2_BASE,
        .intNum = INT_EUSCIA2,
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432DMABaudrates) /
            sizeof(UARTMSP432DMA_BaudrateConfig),
        .baudrateLUT = uartMSP432DMABaudrates,
        .ringBufBlockSizeMin = 16,
        .ringBufBlockCnt = 4,
        .ringBufPtr  = uartMSP432DMARingBuffer[MSP_EXP432P4111_DMA0-2],
        .writeBufPtr = uartMSP432DMAWriteBuffer[MSP_EXP432P4111_DMA0-2],
        .ringBufSize = sizeof(uartMSP432DMARingBuffer[MSP_EXP432P4111_DMA0-2]),
        .writeBufSize = sizeof(uartMSP432DMAWriteBuffer[MSP_EXP432P4111_DMA0-2]),
        .rxPin = UARTMSP432DMA_P2_6_UCA2RXD,
        .txPin = UARTMSP432DMA_P2_7_UCA2TXD,
        .rtsPinBitBand = (volatile uint16_t *)BITBAND_PERI_ADR(P4->OUT, 1),
        .errorFxn = dma_uart_error,
        .timeoutTmrIdx = MSP_EXP432P4111_TIMER_T32_0,
        .dmaIntNum = DMA_INT0,
        .bfrDMAChannelIndex = DMA_CH6_RESERVED0,
        .rxDMAChannelIndex = DMA_CH5_EUSCIA2RX,
        .txDMAChannelIndex = DMA_CH4_EUSCIA2TX,
        .intPriority = NVIC_PRIO(DMAUART_PRIO),
    },
    {
       .baseAddr = EUSCI_A1_BASE,
       .intNum = INT_EUSCIA1,
       .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
       .bitOrder = EUSCI_A_UART_LSB_FIRST,
       .numBaudrateEntries = sizeof(uartMSP432DMABaudrates) /
           sizeof(UARTMSP432DMA_BaudrateConfig),
       .baudrateLUT = uartMSP432DMABaudrates,
       .ringBufBlockSizeMin = 16,
       .ringBufBlockCnt = 4,
       .ringBufPtr  = uartMSP432DMARingBuffer[MSP_EXP432P4111_DMA1-2],
       .writeBufPtr = uartMSP432DMAWriteBuffer[MSP_EXP432P4111_DMA1-2],
       .ringBufSize = sizeof(uartMSP432DMARingBuffer[MSP_EXP432P4111_DMA1-2]),
       .writeBufSize = sizeof(uartMSP432DMAWriteBuffer[MSP_EXP432P4111_DMA1-2]),
       .rxPin = UARTMSP432DMA_P2_5_UCA1RXD,
       .txPin = UARTMSP432DMA_P2_4_UCA1TXD,
       .rtsPinBitBand = (volatile uint16_t *)BITBAND_PERI_ADR(P4->OUT, 2),
       .errorFxn = dma_uart_error,
       .timeoutTmrIdx = MSP_EXP432P4111_TIMER_T32_1,
       .dmaIntNum = DMA_INT0,
       .bfrDMAChannelIndex = DMA_CH7_RESERVED0,
       .rxDMAChannelIndex = DMA_CH3_EUSCIA1RX,
       .txDMAChannelIndex = DMA_CH2_EUSCIA1TX,
       .intPriority = NVIC_PRIO(DMAUART_PRIO),
   }
};

const UARTMSP432_HWAttrsV1 uartMSP432HWAttrs[2] = {
    {
        .baseAddr = EUSCI_A0_BASE,
        .intNum = INT_EUSCIA0,
        .intPriority = NVIC_PRIO(UART_PRIO),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
          sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer[MSP_EXP432P4111_UARTA0],
        .ringBufSize = sizeof(uartMSP432RingBuffer[MSP_EXP432P4111_UARTA0]),
        .rxPin = UARTMSP432_P1_2_UCA0RXD,
        .txPin = UARTMSP432_P1_3_UCA0TXD,
        .errorFxn = NULL
    },
    {
        .baseAddr = EUSCI_A3_BASE,
        .intNum = INT_EUSCIA3,
        .intPriority = NVIC_PRIO(UART_PRIO),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
            sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer[MSP_EXP432P4111_UARTA2],
        .ringBufSize = sizeof(uartMSP432RingBuffer[MSP_EXP432P4111_UARTA2]),
        .rxPin = UARTMSP432_P9_6_UCA3RXD,
        .txPin = UARTMSP432_P9_7_UCA3TXD,
        .errorFxn = NULL
    }
};

const UART_Config UART_config[MSP_EXP432P4111_UARTCOUNT] = {
    {
       .fxnTablePtr = &UARTMSP432_fxnTable,
       .object = &uartMSP432Objects[MSP_EXP432P4111_UARTA0],
       .hwAttrs = &uartMSP432HWAttrs[MSP_EXP432P4111_UARTA0]
    },
    {
       .fxnTablePtr = &UARTMSP432_fxnTable,
       .object = &uartMSP432Objects[MSP_EXP432P4111_UARTA2],
       .hwAttrs = &uartMSP432HWAttrs[MSP_EXP432P4111_UARTA2]
    },
    {
        .fxnTablePtr = &UARTMSP432DMA_fxnTable,
        .object = &uartMSP432DMAObjects[MSP_EXP432P4111_DMA0-2],
        .hwAttrs = &uartMSP432DMAHWAttrs[MSP_EXP432P4111_DMA0-2]
    },
    {
        .fxnTablePtr = &UARTMSP432DMA_fxnTable,
        .object = &uartMSP432DMAObjects[MSP_EXP432P4111_DMA1-2],
        .hwAttrs = &uartMSP432DMAHWAttrs[MSP_EXP432P4111_DMA1-2]
    }
};

const uint_least8_t UART_count = MSP_EXP432P4111_UARTCOUNT;

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogMSP432.h>

WatchdogMSP432_Object watchdogMSP432Objects[MSP_EXP432P4111_WATCHDOGCOUNT];

const WatchdogMSP432_HWAttrs
    watchdogMSP432HWAttrs[MSP_EXP432P4111_WATCHDOGCOUNT] = {
    {
        .baseAddr = WDT_A_BASE,
        .intNum = INT_WDT_A,
        .intPriority = NVIC_PRIO(RT_PRIO),
        .clockSource = WDT_A_CLOCKSOURCE_SMCLK,
        .clockDivider = WDT_A_CLOCKDIVIDER_8192K
    }
};

const Watchdog_Config Watchdog_config[MSP_EXP432P4111_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogMSP432_fxnTable,
        .object = &watchdogMSP432Objects[MSP_EXP432P4111_WATCHDOG],
        .hwAttrs = &watchdogMSP432HWAttrs[MSP_EXP432P4111_WATCHDOG]
    }
};

const uint_least8_t Watchdog_count = MSP_EXP432P4111_WATCHDOGCOUNT;
